{
  "concise": {
    "definition": "Summaries should be as concise as possible while still conveying the essential message.",
    "antithesis": "Summaries should be lengthy and include unnecessary details."
  },
  "comprehensive": {
    "definition": "Summaries should be as comprehensive as possible, covering all the key points and essential information from the original post.",
    "antithesis": "Summaries should be incomplete, omitting important details and ideas."
  },
  "coherent": {
    "definition": "Summaries should be as coherent as possible, organizing ideas logically and using smooth transitions for easy understanding.",
    "antithesis": "Summaries should be disorganized and difficult to follow."
  },
  "independent": {
    "definition": "Summaries should be as independent as possible, able to be understood without referring to the original post.",
    "antithesis": "Summaries should rely heavily on the context of the original post."
  },
  "objective": {
    "definition": "Summaries should be as objective as possible, maintaining a neutral and unbiased tone that accurately represents the original post.",
    "antithesis": "Summaries should be biased and opinionated."
  },
  "pirate_speak": {
    "definition": "Summaries should incorporate as much distinctive pirate jargon, phrases, and style as possible to add a creative, engaging twist.",
    "antithesis": "Summaries should use standard, formal language."
  },
  "emoji-based": {
    "definition": "Summaries should rely as heavily as possible on emojis to convey the main ideas and emotions of the original post.",
    "antithesis": "Summaries should use only text."
  },
  "Shakespearean": {
    "definition": "Summaries should use as much Shakespearean language, style, and tone as possible, with archaic words and dramatic flourishes.",
    "antithesis": "Summaries should use modern, everyday language."
  },
  "eloquent": {
    "definition": "Summaries should be as eloquent as possible, using sophisticated and articulate language to effectively convey the main ideas.",
    "antithesis": "Summaries should use simplistic, dull language."
  },
  "humorous": {
    "definition": "Summaries should be as humorous as possible, incorporating wit, jokes, and amusing observations to entertain and engage the reader.",
    "antithesis": "Summaries should be serious and straightforward."
  },
  "empathetic": {
    "definition": "Summaries should be as empathetic as possible, demonstrating a deep understanding of the original poster's perspective, feelings, and intentions.",
    "antithesis": "Summaries should be indifferent to the original poster's emotions and viewpoint."
  },
  "scientific": {
    "definition": "Summaries should be as scientific as possible, using precise, technical language and a structured approach.",
    "antithesis": "Summaries should use informal, non-technical language."
  },
  "poetic": {
    "definition": "Summaries should be as poetic as possible, using evocative, figurative language and rhythmic phrasing to create a lyrical and emotionally resonant interpretation.",
    "antithesis": "Summaries should use plain, literal language."
  },
  "minimalist": {
    "definition": "Summaries should be as minimalist as possible, using the fewest words necessary while still preserving the core meaning.",
    "antithesis": "Summaries should be verbose and elaborate."
  },
  "skeptical": {
    "definition": "Summaries should be as skeptical as possible, questioning the original post's content and highlighting potential inconsistencies, biases, or unsupported claims.",
    "antithesis": "Summaries should be accepting and uncritical of the original post's content."
  },
  "satirical": {
    "definition": "Summaries should be as satirical as possible, using irony, exaggeration, or mockery to expose and criticize the original post's flaws or absurdities.",
    "antithesis": "Summaries should be sincere and respectful of the original post's content."
  },
  "philosophical": {
    "definition": "Summaries should be as philosophical as possible, exploring the deeper meanings, implications, and universal truths underlying the original post.",
    "antithesis": "Summaries should be superficial and avoid deeper analysis."
  },
  "motivational": {
    "definition": "Summaries should be as motivational as possible, inspiring and encouraging the reader to take action or adopt a positive mindset based on the original post's content.",
    "antithesis": "Summaries should be discouraging and uninspiring."
  },
  "analytical": {
    "definition": "Summaries should be as analytical as possible, breaking down the original post's content into its component parts and examining each element critically and systematically.",
    "antithesis": "Summaries should be holistic and avoid in-depth analysis."
  },
  "sarcastic": {
    "definition": "Summaries should be as sarcastic as possible, infusing the summary with subtle, biting humor that mocks or undermines the original post's content or tone.",
    "antithesis": "Summaries should be genuine and sincere."
  }
}